blackmagic-debug/blackmagic/src/target/stm32h5.c
/*
 * This file is part of the Black Magic Debug project.
 *
 * Copyright (C) 2023-2025 1BitSquared <info@1bitsquared.com>
 * Written by Rachel Mant <git@dragonmux.network>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from
 *    this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 * This file implements support for STM32H5xx and STM32C5xx series devices, providing
 * memory maps and Flash programming routines.
 *
 * References:
 * RM0481 - STM32H563, H573 and H562 Arm®-based 32-bit MCUs, Rev. 1
 *   https://www.st.com/resource/en/reference_manual/rm0481-stm32h563h573-and-stm32h562-armbased-32bit-mcus-stmicroelectronics.pdf
 * RM0492 - STM32H503 Arm®-based 32-bit MCUs, Rev. 2
 *   https://www.st.com/resource/en/reference_manual/rm0492-stm32h503-line-armbased-32bit-mcus-stmicroelectronics.pdf
 * RM0522 - STM32C5xx Arm®-based 32-bit MCUs, Rev. 1
 *   https://www.st.com/resource/en/reference_manual/rm0522-stm32c5-series-armbased-32bit-mcus-stmicroelectronics.pdf
 */

#include "general.h"
#include "target.h"
#include "target_internal.h"
#include "cortexm.h"
#include "stm32_common.h"

/* Memory map constants for STM32H5xx */
#define STM32H5_FLASH_BANK1_BASE 0x08000000U
#define STM32H5_FLASH_BANK_SIZE  0x00100000U
#define STM32H5_SRAM1_BASE       0x0a000000U
#define STM32H5_SRAM1_SIZE       0x00040000U
#define STM32H5_SRAM2_BASE       0x0a040000U
#define STM32H5_SRAM2_SIZE       0x00010000U
#define STM32H5_SRAM3_BASE       0x0a050000U
#define STM32H5_SRAM3_SIZE       0x00050000U
#define STM32H5_SRAM_ALIAS_BASE  0x20000000U
#define STM32H5_SRAM123_SIZE     (STM32H5_SRAM1_SIZE + STM32H5_SRAM2_SIZE + STM32H5_SRAM3_SIZE)
/* NB: Take all base addresses and add 0x04000000U to find their TrustZone addresses */

/* Memory map constants for the STM32H503 */
#define STM32H503_FLASH_BANK1_BASE 0x08000000U
#define STM32H503_FLASH_BANK2_BASE 0x08010000U
#define STM32H503_FLASH_BANK_SIZE  0x00010000U
#define STM32H503_SRAM1_BASE       0x0a000000U
#define STM32H503_SRAM1_SIZE       0x00004000U
#define STM32H503_SRAM2_BASE       0x0a004000U
#define STM32H503_SRAM2_SIZE       0x00004000U
#define STM32H503_SRAM1_ALIAS      0x20000000U
#define STM32H503_SRAM2_ALIAS      0x20004000U
/* Memory map constants for STM32H523/H533 */
#define STM32H523_FLASH_BANK1_BASE 0x08000000U
#define STM32H523_FLASH_BANK_SIZE  0x00040000U
#define STM32H523_SRAM1_BASE       0x0a000000U
#define STM32H523_SRAM1_SIZE       0x00020000U
#define STM32H523_SRAM2_BASE       0x0a020000U
#define STM32H523_SRAM2_SIZE       0x00014000U
#define STM32H523_SRAM3_BASE       0x0a034000U
#define STM32H523_SRAM3_SIZE       0x00010000U
#define STM32H523_SRAM123_SIZE     (STM32H523_SRAM1_SIZE + STM32H523_SRAM2_SIZE + STM32H523_SRAM3_SIZE)

/* Memory map constants for STM32C53x/C54x */
#define STM32C53X_FLASH_BANK1_BASE 0x08000000U
#define STM32C53X_FLASH_BANK2_BASE 0x08020000U
#define STM32C53X_FLASH_BANK_SIZE  0x00020000U
#define STM32C53X_SECTORS_PER_BANK 0x00000010U
#define STM32C53X_SRAM1_BASE       0x0a000000U
#define STM32C53X_SRAM1_SIZE       0x00008000U
#define STM32C53X_SRAM2_BASE       0x0a008000U
#define STM32C53X_SRAM2_SIZE       0x00008000U
#define STM32C53X_SRAM_ALIAS_BASE  0x20000000U
#define STM32C53X_SRAM12_SIZE     (STM32C53X_SRAM1_SIZE + STM32C53X_SRAM2_SIZE)
/* Memory map constants for STM32C55x/C56x */
#define STM32C55X_FLASH_BANK1_BASE 0x08000000U
#define STM32C55X_FLASH_BANK2_BASE 0x08040000U
#define STM32C55X_FLASH_BANK_SIZE  0x00040000U
#define STM32C55X_SECTORS_PER_BANK 0x00000020U
#define STM32C55X_SRAM1_BASE       0x0a000000U
#define STM32C55X_SRAM1_SIZE       0x00010000U
#define STM32C55X_SRAM2_BASE       0x0a010000U
#define STM32C55X_SRAM2_SIZE       0x00010000U
#define STM32C55X_SRAM_ALIAS_BASE  0x20000000U
#define STM32C55X_SRAM12_SIZE     (STM32C55X_SRAM1_SIZE + STM32C55X_SRAM2_SIZE)
/* Memory map constants for STM32C59x/C5Ax */
#define STM32C59X_FLASH_BANK1_BASE 0x08000000U
#define STM32C59X_FLASH_BANK2_BASE 0x08080000U
#define STM32C59X_FLASH_BANK_SIZE  0x00080000U
#define STM32C59X_SECTORS_PER_BANK 0x00000040U
#define STM32C59X_SRAM1_BASE       0x0a000000U
#define STM32C59X_SRAM1_SIZE       0x00020000U
#define STM32C59X_SRAM2_BASE       0x0a020000U
#define STM32C59X_SRAM2_SIZE       0x00020000U
#define STM32C59X_SRAM_ALIAS_BASE  0x20000000U
#define STM32C59X_SRAM12_SIZE     (STM32C59X_SRAM1_SIZE + STM32C59X_SRAM2_SIZE)

/* Flash Program and Erase Controller (FPEC) Register Map */
#define STM32H5_FPEC_BASE        0x40022000
#define STM32H5_FPEC_ACCESS_CTRL (STM32H5_FPEC_BASE + 0x000U)
#define STM32H5_FPEC_KEY         (STM32H5_FPEC_BASE + 0x004U)
#define STM32H5_FPEC_OPTION_KEY  (STM32H5_FPEC_BASE + 0x00cU)
#define STM32H5_FPEC_STATUS      (STM32H5_FPEC_BASE + 0x020U)
#define STM32H5_FPEC_CTRL        (STM32H5_FPEC_BASE + 0x028U)
#define STM32H5_FPEC_CLEAR_CTRL  (STM32H5_FPEC_BASE + 0x030U)

#define STM32H5_FPEC_KEY1              0x45670123U
#define STM32H5_FPEC_KEY2              0xcdef89abU
#define STM32H5_FPEC_STATUS_BUSY       (1U << 0U)
#define STM32H5_FPEC_STATUS_EOP        (1U << 16U)
#define STM32H5_FPEC_STATUS_ERROR_MASK 0x00fc0000U
#define STM32H5_FPEC_CTRL_LOCK         (1U << 0U)
#define STM32H5_FPEC_CTRL_PROGRAM      (1U << 1U)
#define STM32H5_FPEC_CTRL_SECTOR_ERASE (1U << 2U)
#define STM32H5_FPEC_CTRL_BANK_ERASE   (1U << 3U)
#define STM32H5_FPEC_CTRL_START        (1U << 5U)
#define STM32H5_FPEC_CTRL_SECTOR(x)    (((x) & 0x7fU) << 6U)
#define STM32H5_FPEC_CTRL_MASS_ERASE   (1U << 15U)
#define STM32H5_FPEC_CTRL_BANK1        (0U << 31U)
#define STM32H5_FPEC_CTRL_BANK2        (1U << 31U)

#define STM32H5_FLASH_SECTOR_SIZE       0x00002000U
#define STM32H503_SECTORS_PER_BANK      8U
#define STM32H5_FLASH_BANK_MASK         0x80000000U
#define STM32H5_FLASH_SECTOR_COUNT_MASK 0x000000ffU

