blackmagic-debug/blackmagic/src/target/stm32h5.c
/*
 * Both on H56x and H503 DBGMCU is visible via AP0 on Debug APB at 0xe0044000,
 * and via AP1 by the processor at 0x44024000 alias.
 */
#define STM32H5_DBGMCU_BASE        0x44024000
#define STM32H5_DBGMCU_IDCODE      (STM32H5_DBGMCU_BASE + 0x00U)
#define STM32H5_DBGMCU_CONFIG      (STM32H5_DBGMCU_BASE + 0x04U)
#define STM32H5_DBGMCU_APB1LFREEZE (STM32H5_DBGMCU_BASE + 0x08U)
#define STM32H5_DBGMCU_APB1HFREEZE (STM32H5_DBGMCU_BASE + 0x0cU)
#define STM32H5_DBGMCU_APB2FREEZE  (STM32H5_DBGMCU_BASE + 0x10U)
#define STM32H5_DBGMCU_APB3FREEZE  (STM32H5_DBGMCU_BASE + 0x14U)
#define STM32H5_DBGMCU_AHB1FREEZE  (STM32H5_DBGMCU_BASE + 0x20U)
#define STM32H5_UID_BASE           0x08fff800U
#define STM32H5_FLASH_SIZE         0x08fff80cU

#define STM32H5_DBGMCU_IDCODE_DEV_MASK    0x00000fffU
#define STM32H5_DBGMCU_IDCODE_REV_MASK    0xffff0000U
#define STM32H5_DBGMCU_IDCODE_REV_SHIFT   16U
#define STM32H5_DBGMCU_CONFIG_DBG_STOP    (1U << 1U)
#define STM32H5_DBGMCU_CONFIG_DBG_STANDBY (1U << 2U)
#define STM32H5_DBGMCU_APB1LFREEZE_WWDG   (1U << 11U)
#define STM32H5_DBGMCU_APB1LFREEZE_IWDG   (1U << 12U)

/* Taken from DBGMCU_IDCODE in §18.12.4 of RM0481 rev 1, pg3085 */
#define ID_STM32H5xx 0x484U
/* Taken from DBGMCU_IDCODE in §41.124 of RM0492 rev 2, pg1807 */
#define ID_STM32H503 0x474U
/* Taken from DBGMCU_IDCODE in §59.12.4 of RM0481 rev 2, pg3116 */
#define ID_STM32H523 0x478U
/* Taken from DBGMCU_IDCODE in §49.12.4 of RM0522 rev 1, pg2542 */
#define ID_STM32C53x 0x44FU	
#define ID_STM32C55x 0x44EU
#define ID_STM32C59x 0x45AU

typedef struct stm32h5_flash {
	target_flash_s target_flash;
	uint32_t bank_and_sector_count;
} stm32h5_flash_s;

static bool stm32h5_cmd_uid(target_s *target, int argc, const char **argv);
static bool stm32h5_cmd_rev(target_s *target, int argc, const char **argv);

const command_s stm32h5_cmd_list[] = {
	{"uid", stm32h5_cmd_uid, "Print unique device ID"},
	{"revision", stm32h5_cmd_rev, "Returns the Device ID and Revision"},
	{NULL, NULL, NULL},
};

static bool stm32h5_attach(target_s *target);
static void stm32h5_detach(target_s *target);
static bool stm32h5_enter_flash_mode(target_s *target);
static bool stm32h5_exit_flash_mode(target_s *target);
static bool stm32h5_flash_erase(target_flash_s *flash, target_addr_t addr, size_t len);
static bool stm32h5_flash_write(target_flash_s *flash, target_addr_t dest, const void *src, size_t len);
static bool stm32h5_mass_erase(target_s *target, platform_timeout_s *print_progess);

static void stm32h5_add_flash(
	target_s *const target, const uint32_t base_addr, const size_t length, const uint32_t bank_and_sector_count)
{
	stm32h5_flash_s *flash = calloc(1, sizeof(*flash));
	if (!flash) { /* calloc failed: heap exhaustion */
		DEBUG_ERROR("calloc: failed in %s\n", __func__);
		return;
	}

	target_flash_s *target_flash = &flash->target_flash;
	target_flash->start = base_addr;
	target_flash->length = length;
	target_flash->blocksize = STM32H5_FLASH_SECTOR_SIZE;
	target_flash->erase = stm32h5_flash_erase;
	target_flash->write = stm32h5_flash_write;
	target_flash->erased = 0xffU;
	target_add_flash(target, target_flash);
	flash->bank_and_sector_count = bank_and_sector_count;
}

static bool stm32h5_configure_dbgmcu(target_s *const target)
{
	/* Now we have a stable debug environment, make sure the WDTs can't bonk the processor out from under us */
	target_mem32_write32(target, STM32H5_DBGMCU_APB1LFREEZE,
		target_mem32_read32(target, STM32H5_DBGMCU_APB1LFREEZE) | STM32H5_DBGMCU_APB1LFREEZE_IWDG |
			STM32H5_DBGMCU_APB1LFREEZE_WWDG);
	/* Then Reconfigure the config register to prevent WFI/WFE from cutting debug access */
	target_mem32_write32(target, STM32H5_DBGMCU_CONFIG,
		target_mem32_read32(target, STM32H5_DBGMCU_CONFIG) | STM32H5_DBGMCU_CONFIG_DBG_STANDBY |
			STM32H5_DBGMCU_CONFIG_DBG_STOP);
	return true;
}

bool stm32h5_probe(target_s *const target)
{
	const adiv5_access_port_s *const ap = cortex_ap(target);
	/* Use the partno from the AP always to handle the difference between JTAG and SWD */
	if (ap->partno != ID_STM32H5xx && ap->partno != ID_STM32H503 && ap->partno != ID_STM32H523)
		return false;
	target->part_id = ap->partno;

	/* Now we have a stable debug environment, make sure the WDTs + WFI and WFE instructions can't cause problems */
	if (!stm32h5_configure_dbgmcu(target))
		return false;

	target->driver = "STM32H5";
	target->attach = stm32h5_attach;
	target->detach = stm32h5_detach;
	target->mass_erase = stm32h5_mass_erase;
	target->enter_flash_mode = stm32h5_enter_flash_mode;
	target->exit_flash_mode = stm32h5_exit_flash_mode;
	target_add_commands(target, stm32h5_cmd_list, target->driver);

	uint16_t flash_size_kb = target_mem32_read16(target, STM32H5_FLASH_SIZE);
	uint32_t flash_bank_size = flash_size_kb * 1024U / 2U;
	uint16_t sectors_per_bank = flash_size_kb / 8U / 2U;
	switch (target->part_id) {
	case ID_STM32H5xx:
		/*
		 * Build the RAM map. 256+64+320=640.
		 * This uses the addresses and sizes found in §2.3.2, Figure 2, pg113 of RM0481 Rev. 1
		 */
		target_add_ram32(target, STM32H5_SRAM1_BASE, STM32H5_SRAM1_SIZE);
		target_add_ram32(target, STM32H5_SRAM2_BASE, STM32H5_SRAM2_SIZE);
		target_add_ram32(target, STM32H5_SRAM3_BASE, STM32H5_SRAM3_SIZE);
		target_add_ram32(target, STM32H5_SRAM_ALIAS_BASE, STM32H5_SRAM123_SIZE);

		/*
		 * Build the Flash map. H562/H563/H573 has one of:
		 * Flash(I): 2048 KiB as two equal banks (128 sectors of 8 KiB each)
		 * Flash(G): 1024 KiB as two equal banks (64 sectors of 8 KiB each)
		 */
		if (flash_size_kb != 1024U && flash_size_kb != 2048U) {
			flash_size_kb = 2048U;
			flash_bank_size = flash_size_kb * 1024U / 2U;
			sectors_per_bank = flash_size_kb / 8U / 2U;
		}
		stm32h5_add_flash(
			target, STM32H5_FLASH_BANK1_BASE, flash_bank_size, sectors_per_bank | STM32H5_FPEC_CTRL_BANK1);
		stm32h5_add_flash(target, STM32H5_FLASH_BANK1_BASE + flash_bank_size, flash_bank_size,
			sectors_per_bank | STM32H5_FPEC_CTRL_BANK2);
		break;
	case ID_STM32H523:
		/*
		 * Build the RAM map. 128+80+64=272.
		 * This uses the addresses and sizes found in §2.3.2, Figure 3, pg117 of RM0481 Rev. 2
		 * See also §6.3.2, Figure 21, pg235 of RM0481 Rev. 2
		 */
		target_add_ram32(target, STM32H523_SRAM1_BASE, STM32H523_SRAM1_SIZE);
		target_add_ram32(target, STM32H523_SRAM2_BASE, STM32H523_SRAM2_SIZE);
		target_add_ram32(target, STM32H523_SRAM3_BASE, STM32H523_SRAM3_SIZE);
		target_add_ram32(target, STM32H5_SRAM_ALIAS_BASE, STM32H523_SRAM123_SIZE);

