blackmagic-debug/blackmagic/src/target/stm32h5.c
		/*
		 * Build the Flash map. H523/H533 has one of:
		 * Flash(E): 512 KiB as two equal banks (32 sectors of 8 KiB each)
		 * Flash(C): 256 KiB as two equal banks (16 sectors of 8 KiB each)
		 */
		if (flash_size_kb != 256U && flash_size_kb != 512U) {
			flash_size_kb = 512U;
			flash_bank_size = flash_size_kb * 1024U / 2U;
			sectors_per_bank = flash_size_kb / 8U / 2U;
		}
		stm32h5_add_flash(
			target, STM32H5_FLASH_BANK1_BASE, flash_bank_size, sectors_per_bank | STM32H5_FPEC_CTRL_BANK1);
		stm32h5_add_flash(target, STM32H5_FLASH_BANK1_BASE + flash_bank_size, flash_bank_size,
			sectors_per_bank | STM32H5_FPEC_CTRL_BANK2);
		break;
	case ID_STM32H503:
		/*
		 * Build the RAM map. 16+16=32.
		 * This uses the addresses and sizes found in §2.2.2, Figure 2, pg70 of RM0492 Rev. 2
		 */
		target_add_ram32(target, STM32H503_SRAM1_BASE, STM32H503_SRAM1_SIZE);
		target_add_ram32(target, STM32H503_SRAM2_BASE, STM32H503_SRAM2_SIZE);
		target_add_ram32(target, STM32H503_SRAM1_ALIAS, STM32H503_SRAM1_SIZE);
		target_add_ram32(target, STM32H503_SRAM2_ALIAS, STM32H503_SRAM2_SIZE);

		/*
		 * Build the Flash map. H503xB has
		 * Flash(B): 128 KiB as two equal banks (8 sectors of 8 KiB each)
		 */
		stm32h5_add_flash(target, STM32H503_FLASH_BANK1_BASE, STM32H503_FLASH_BANK_SIZE,
			STM32H503_SECTORS_PER_BANK | STM32H5_FPEC_CTRL_BANK1);
		stm32h5_add_flash(target, STM32H503_FLASH_BANK2_BASE, STM32H503_FLASH_BANK_SIZE,
			STM32H503_SECTORS_PER_BANK | STM32H5_FPEC_CTRL_BANK2);
		break;
	default:
		return false;
	}

	return true;
}

bool stm32c5_probe(target_s *const target)
{
	const adiv5_access_port_s *const ap = cortex_ap(target);
	/* Use the partno from the AP always to handle the difference between JTAG and SWD */
	if (ap->partno != ID_STM32C55x && ap->partno != ID_STM32C53x && ap->partno != ID_STM32C59x)
		return false;
	target->part_id = ap->partno;

	/* Now we have a stable debug environment, make sure the WDTs + WFI and WFE instructions can't cause problems */
	if (!stm32h5_configure_dbgmcu(target))
		return false;

	target->driver = "STM32H5";
	target->attach = stm32h5_attach;
	target->detach = stm32h5_detach;
	target->mass_erase = stm32h5_mass_erase;
	target->enter_flash_mode = stm32h5_enter_flash_mode;
	target->exit_flash_mode = stm32h5_exit_flash_mode;
	target_add_commands(target, stm32h5_cmd_list, target->driver);
	
	switch (target->part_id) {
	case ID_STM32C53x:
		/*
		 * Build the RAM map. 32+32=64.
		 * This uses the addresses and sizes found in §2.2.2, Figure 2, pg91 of RM0522 Rev. 1
		 */
		target_add_ram32(target, STM32C53X_SRAM1_BASE, STM32C53X_SRAM1_SIZE);
		target_add_ram32(target, STM32C53X_SRAM2_BASE, STM32C53X_SRAM2_SIZE);
		target_add_ram32(target, STM32C53X_SRAM_ALIAS_BASE, STM32C53X_SRAM12_SIZE);

		/*
		 * Build the Flash map. C53X/C54X has one of:
		 * Flash: 256 KiB as two equal banks (16 sectors of 8 KiB each)
		 */
		stm32h5_add_flash(target, STM32C53X_FLASH_BANK1_BASE, STM32C53X_FLASH_BANK_SIZE,
			STM32C53X_SECTORS_PER_BANK | STM32H5_FPEC_CTRL_BANK1);
		stm32h5_add_flash(target, STM32C53X_FLASH_BANK2_BASE, STM32C53X_FLASH_BANK_SIZE,
			STM32C53X_SECTORS_PER_BANK | STM32H5_FPEC_CTRL_BANK2);
		break;
	case ID_STM32C55x:
		/*
		 * Build the RAM map. 64+64=128.
		 * This uses the addresses and sizes found in §2.2.2, Figure 3, pg92 of RM0522 Rev. 1
		 */
		target_add_ram32(target, STM32C55X_SRAM1_BASE, STM32C55X_SRAM1_SIZE);
		target_add_ram32(target, STM32C55X_SRAM2_BASE, STM32C55X_SRAM2_SIZE);
		target_add_ram32(target, STM32C55X_SRAM_ALIAS_BASE, STM32C55X_SRAM12_SIZE);

		/*
		 * Build the Flash map. C55X/C56X has one of:
		 * Flash: 512 KiB as two equal banks (32 sectors of 8 KiB each)
		 */
		stm32h5_add_flash(target, STM32C55X_FLASH_BANK1_BASE, STM32C55X_FLASH_BANK_SIZE,
			STM32C55X_SECTORS_PER_BANK | STM32H5_FPEC_CTRL_BANK1);
		stm32h5_add_flash(target, STM32C55X_FLASH_BANK2_BASE, STM32C55X_FLASH_BANK_SIZE,
			STM32C55X_SECTORS_PER_BANK | STM32H5_FPEC_CTRL_BANK2);
		break;
	case ID_STM32C59x:
		/*
		 * Build the RAM map. 128+128=256.
		 * This uses the addresses and sizes found in §2.2.2, Figure 4, pg93 of RM0522 Rev. 1
		 */
		target_add_ram32(target, STM32C59X_SRAM1_BASE, STM32C59X_SRAM1_SIZE);
		target_add_ram32(target, STM32C59X_SRAM2_BASE, STM32C59X_SRAM2_SIZE);
		target_add_ram32(target, STM32C59X_SRAM_ALIAS_BASE, STM32C59X_SRAM12_SIZE);

		/*
		 * Build the Flash map. C59X has
		 * Flash: 1 MiB as two equal banks (64 sectors of 8 KiB each)
		 */
		stm32h5_add_flash(target, STM32C59X_FLASH_BANK1_BASE, STM32C59X_FLASH_BANK_SIZE,
			STM32C55X_SECTORS_PER_BANK | STM32H5_FPEC_CTRL_BANK1);
		stm32h5_add_flash(target, STM32C59X_FLASH_BANK2_BASE, STM32C59X_FLASH_BANK_SIZE,
			STM32C55X_SECTORS_PER_BANK | STM32H5_FPEC_CTRL_BANK2);
		break;
	default:
		return false;
	}

	return true;
}

static bool stm32h5_attach(target_s *const target)
{
	/*
	 * Try to attach to the part, and then ensure that the WDTs + WFI and WFE
	 * instructions can't cause problems (this is duplicated as it's undone by detach.)
	 */
	return cortexm_attach(target) && stm32h5_configure_dbgmcu(target);
}

static void stm32h5_detach(target_s *target)
{
	/* Reverse all changes to the DBGMCU control and freeze registers */
	target_mem32_write32(target, STM32H5_DBGMCU_APB1LFREEZE,
		target_mem32_read32(target, STM32H5_DBGMCU_APB1LFREEZE) &
			~(STM32H5_DBGMCU_APB1LFREEZE_IWDG | STM32H5_DBGMCU_APB1LFREEZE_WWDG));
	target_mem32_write32(target, STM32H5_DBGMCU_CONFIG,
		target_mem32_read32(target, STM32H5_DBGMCU_CONFIG) &
			~(STM32H5_DBGMCU_CONFIG_DBG_STANDBY | STM32H5_DBGMCU_CONFIG_DBG_STOP));
	/* Now defer to the normal Cortex-M detach routine to complete the detach */
	cortexm_detach(target);
}

static bool stm32h5_flash_wait_complete(target_s *const target, platform_timeout_s *const timeout)
{
	uint32_t status = STM32H5_FPEC_STATUS_BUSY;
	/* Read the status register and poll for busy and !EOP */
	while (!(status & STM32H5_FPEC_STATUS_EOP) && (status & STM32H5_FPEC_STATUS_BUSY)) {
		status = target_mem32_read32(target, STM32H5_FPEC_STATUS);
		if (target_check_error(target)) {
			DEBUG_ERROR("%s: error reading status\n", __func__);
			return false;
		}
		if (timeout)
			target_print_progress(timeout);
	}
	if (status & STM32H5_FPEC_STATUS_ERROR_MASK)
		DEBUG_ERROR("%s: Flash error: %08" PRIx32 "\n", __func__, status);
	/* Clear all error and status bits */
	target_mem32_write32(
		target, STM32H5_FPEC_CLEAR_CTRL, status & (STM32H5_FPEC_STATUS_ERROR_MASK | STM32H5_FPEC_STATUS_EOP));
	return !(status & STM32H5_FPEC_STATUS_ERROR_MASK);
}

static bool stm32h5_enter_flash_mode(target_s *const target)
{
	target_reset(target);
	/* Wait to ensure any pending operations are complete */
	if (!stm32h5_flash_wait_complete(target, NULL))
		return false;
	/* Now, if the Flash controller's not already unlocked, unlock it */
	if (target_mem32_read32(target, STM32H5_FPEC_CTRL) & STM32H5_FPEC_CTRL_LOCK) {
		target_mem32_write32(target, STM32H5_FPEC_KEY, STM32H5_FPEC_KEY1);
		target_mem32_write32(target, STM32H5_FPEC_KEY, STM32H5_FPEC_KEY2);
	}
	/* Success of entering Flash mode is predicated on successfully unlocking the controller */
	return !(target_mem32_read32(target, STM32H5_FPEC_CTRL) & STM32H5_FPEC_CTRL_LOCK);
}

static bool stm32h5_exit_flash_mode(target_s *const target)
{
	/* On leaving Flash mode, lock the controller again */
	target_mem32_write32(target, STM32H5_FPEC_CTRL, STM32H5_FPEC_CTRL_LOCK);
	target_reset(target);
	return true;
}

static bool stm32h5_flash_erase(target_flash_s *const target_flash, const target_addr_t addr, const size_t len)
{
	(void)len;
	target_s *const target = target_flash->t;
	const stm32h5_flash_s *const flash = (stm32h5_flash_s *)target_flash;
	/* Compute how many sectors should be erased (inclusive) and from which bank */
	const uint32_t begin = addr - target_flash->start;
	const uint32_t bank = flash->bank_and_sector_count & STM32H5_FLASH_BANK_MASK;
	const size_t sector = begin / STM32H5_FLASH_SECTOR_SIZE;

	/* Erase the current Flash sector */
	const uint32_t ctrl = bank | STM32H5_FPEC_CTRL_SECTOR_ERASE | STM32H5_FPEC_CTRL_SECTOR(sector);
	target_mem32_write32(target, STM32H5_FPEC_CTRL, ctrl);
	target_mem32_write32(target, STM32H5_FPEC_CTRL, ctrl | STM32H5_FPEC_CTRL_START);

