blackmagic-debug/blackmagic/src/target/stm32h5.c
	/* Wait for the operation to complete, reporting errors */
	return stm32h5_flash_wait_complete(target, NULL);
}

static bool stm32h5_flash_write(
	target_flash_s *const flash, const target_addr_t dest, const void *const src, const size_t len)
{
	target_s *const target = flash->t;
	/* Enable programming operations */
	target_mem32_write32(target, STM32H5_FPEC_CTRL, STM32H5_FPEC_CTRL_PROGRAM);
	/* Write the data to the Flash */
	target_mem32_write(target, dest, src, len);
	/* Wait for the operation to complete and report errors */
	if (!stm32h5_flash_wait_complete(target, NULL))
		return false;
	/* Disable programming operations */
	target_mem32_write32(target, STM32H5_FPEC_CTRL, 0U);
	return true;
}

static bool stm32h5_mass_erase(target_s *const target, platform_timeout_s *const print_progess)
{
	/* Trigger the mass erase */
	target_mem32_write32(target, STM32H5_FPEC_CTRL, STM32H5_FPEC_CTRL_MASS_ERASE);
	target_mem32_write32(target, STM32H5_FPEC_CTRL, STM32H5_FPEC_CTRL_MASS_ERASE | STM32H5_FPEC_CTRL_START);
	/* And wait for it to complete, reporting errors along the way */
	return stm32h5_flash_wait_complete(target, print_progess);
}

static bool stm32h5_cmd_uid(target_s *target, int argc, const char **argv)
{
	(void)argc;
	(void)argv;
	return stm32_uid(target, STM32H5_UID_BASE);
}

static const struct {
	uint16_t rev_id;
	char revision;
} stm32h5_revisions[] = {
	{0x1000U, 'A'},
	{0x1001U, 'Z'},
	{0x1002U, 'Y'},
	{0x1007U, 'X'},
};

static const struct {
	uint16_t rev_id;
	char revision;
} stm32c5_revisions[] = {
	{0x1000U, 'A'},
	{0x1001U, 'Z'},
	{0x1003U, 'Y'},
};

static bool stm32h5_cmd_rev(target_s *target, int argc, const char **argv)
{
	(void)argc;
	(void)argv;
	/* Read the device identity register */
	const uint32_t idcode = target_mem32_read32(target, STM32H5_DBGMCU_IDCODE);
	const uint16_t rev_id = (idcode & STM32H5_DBGMCU_IDCODE_REV_MASK) >> STM32H5_DBGMCU_IDCODE_REV_SHIFT;
	const uint16_t dev_id = idcode & STM32H5_DBGMCU_IDCODE_DEV_MASK;
	uint8_t isC5 = 0;
	
	/* Display the device ID */
	switch (dev_id) {
	case ID_STM32H5xx:
		tc_printf(target, "STM32H56x/57x\n");
		break;
	case ID_STM32H503:
		tc_printf(target, "STM32H503\n");
		break;
	case ID_STM32H523:
		tc_printf(target, "STM32H523/533\n");
		break;
	case ID_STM32C53x:
		tc_printf(target, "STM32C53x/54x\n");
		isC5 = 1;
		break;
	case ID_STM32C55x:
		tc_printf(target, "STM32C55x/56x\n");
		isC5 = 1;
		break;
	case ID_STM32C59x:
		tc_printf(target, "STM32C59x/5Ax\n");
		isC5 = 1;
		break;
	default:
		tc_printf(target, "Unknown %s. BMP may not correctly support it!\n", target->driver);
	}
	char revision = '?';
	if(!isC5) {
		for (size_t i = 0; i < ARRAY_LENGTH(stm32h5_revisions); ++i) {
			if (stm32h5_revisions[i].rev_id == rev_id)
				revision = stm32h5_revisions[i].revision;
		}
	} else {
		for (size_t i = 0; i < ARRAY_LENGTH(stm32c5_revisions); ++i) {
			if (stm32c5_revisions[i].rev_id == rev_id)
				revision = stm32h5_revisions[i].revision;
		}
	}
	tc_printf(target, "Revision %c\n", revision);
	return true;
}
